// int num1 = 25;
// double num2 = 13.45;
// string word = "Sasha";
// char symbol = '%';
// bool chek = num1 > num2;
// Console.WriteLine ("my number is " + num1 + "and" + num2);
// Console.WriteLine ($"my number are {num1}  and  {num2} ");

//Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.

// Console.Write("Input a first number: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input a second number: ");
// int number2 = Convert.ToInt32(Console.ReadLine());
// int quad2 = number2 * number2;

// if(number1 == quad2)  // точка с запятой не ставиться
// {
//     Console.WriteLine("Yes!");
// }
// else
// {
//     Console.WriteLine("No!");
// }

// Task 2. Напишите программу, которая на вход принимает одно число (N),
// а на выходе показывает все целые числа в промежутке от -N до N.

/*
Console.Write("Input a positive number: ");
int num = Convert.ToInt32(Console.ReadLine());

int current = -num;

while(current <= num)
{
    Console.Write(current + "");
    current++; // current = current + 2 или current +=2  примеры
}
*/

// 34215/10 3421
// 34215/100 342
// 34215/1000 34
// 34215/10000 3

// 34215%10     5
// 34215%100    15 
// 34215%1000   215
// 34215%10000  4215

// 28563 56     %1000/10  пример